service-soap-dayWeek/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getDayRequest>
         <gs:dia>Lunes</gs:dia>
      </gs:getDayRequest>
   </soapenv:Body>
</soapenv:Envelope>